export const questions = [
    {
        title: 'useState() - это',
        anwsers: ['Hook','Переменная','Папка'],
        correctAnwser: 0
    },
    {
        title: 'Для чего используются props',
        anwsers: ['Для прикола','Для передачи данных из одного компонента в другой','Для вызова функции в не компонента'],
        correctAnwser: 1
    },
    {
        title: 'Почему useEffect() может начать замыкание сам в себе',
        anwsers: ['Из-за того, что не указан объект, за чьим рендером должен следить хук','Потому что ему так хочется','Просто так'],
        correctAnwser: 0
    },
    {
        title: 'Когда появился React',
        anwsers: ['2011','2015','2013'],
        correctAnwser: 2
    },
    
    
]